// package sem_6;

// /*
// Задание №2
// 1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для
// приложения, которое является
// а) информационной системой ветеринарной клиники
// б) архивом выставки котов
// в) информационной системой Театра кошек Ю. Д. Куклачёва
// Можно записать в текстовом виде, не обязательно реализовывать в java.
// */

// Ветеринарная клиника

// Поля:
// Кличка (name)
// Порода (breed)
// Окрас (colour)
// Возраст (age)
// Владелец (owner)
// Номер карты (cardId)
// Прививки (vaccinationList)
// История посещений (visitHistory)

// Методы:
// Получение данных (getName, getBreed, getAge...)
// Установка данных (setName, setBreed, setAge...)
// Добавление прививки (addVaccination)
// Посещение (addVisit)


// Архив выставки котов

// Поля:
// Кличка (name)
// Порода (breed)
// Окрас (colour)
// Возраст (age)
// Владелец (owner)
// Прививки (vaccinationList)
// История участий (historyOfParticipation)
// Награды (awards)

// Методы:
// Получение данных (getName, getBreed, getAge...)
// Установка данных (setName, setBreed, setAge...)
// Добавление прививки (addVaccination)
// Посещение (addVisit)
// Добавить награду (addAwards)


// Театр кошек

// Поля:
// Кличка (name)
// Порода (breed)
// Окрас (colour)
// Возраст (age)
// Дрессировщик (trainer)
// Прививки (vaccinationList)
// Навыки (skills)

// Методы:
// Получение данных (getName, getBreed, getAge...)
// Установка данных (setName, setBreed, setAge...)
// Добавление прививки (addVaccination)
// Добавить навык (addSkills)